2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/GBAConversie-Registratie-Verhuizing_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:brp="http://www.bzk.nl/brp/brp0200">
   <soapenv:Header/>
   <soapenv:Body>
      <brp:bhg_vbaRegistreerVerhuizing>
         <brp:stuurgegevens brp:communicatieID="comid_stuurgegevens">
            <brp:zendendePartij>036101</brp:zendendePartij>
            <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
            <brp:referentienummer>00000000-0000-0000-0001-000000000001</brp:referentienummer>
            <brp:tijdstipVerzending>${DataSource Values#tijdstipVerzending}</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="comid_params">
            <brp:verwerkingswijze>Bijhouding</brp:verwerkingswijze>
         </brp:parameters>
         <brp:verhuizingIntergemeentelijk brp:objecttype="AdministratieveHandeling" brp:communicatieID="comid.VerhInterGem">
            <brp:partijCode>036101</brp:partijCode>
            <brp:bronnen>
               <brp:bron brp:objecttype="ActieBron" brp:communicatieID="comid.Bron1">
                  <brp:document brp:objecttype="Document" brp:communicatieID="comid.Document1">
                     <brp:soortNaam>Aangifte met betrekking tot verblijfplaats</brp:soortNaam>
                     <brp:identificatie>123</brp:identificatie>
                     <brp:aktenummer>4567890</brp:aktenummer>
                     <brp:partijCode>036101</brp:partijCode>
                  </brp:document>
               </brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieAdres brp:objecttype="Actie" brp:communicatieID="comid.Actie">
                  <brp:datumAanvangGeldigheid>2014-04-01</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:bron brp:objecttype="ActieBron" brp:referentieID="comid.Bron1" brp:communicatieID="comid.Bron2"/>
                  </brp:bronnen>
                  <brp:persoon brp:objecttype="Persoon" brp:objectSleutel="${DataSource Values#burgerServiceNummer}" brp:communicatieID="comid.Pers1">
                     <brp:adressen>
                        <brp:adres brp:objecttype="PersoonAdres" brp:communicatieID="comid.Adres">
                           <brp:soortCode>B</brp:soortCode>
                           <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
                           <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
                           <brp:datumAanvangAdreshouding>2014-04-01</brp:datumAanvangAdreshouding>
                           <brp:identificatiecodeAdresseerbaarObject>1234017890123450</brp:identificatiecodeAdresseerbaarObject>
                           <brp:identificatiecodeNummeraanduiding>1234017890123456</brp:identificatiecodeNummeraanduiding>
                           <brp:gemeenteCode>1859</brp:gemeenteCode>
                           <brp:naamOpenbareRuimte>Wijk21</brp:naamOpenbareRuimte>
                           <brp:afgekorteNaamOpenbareRuimte>W19SCH</brp:afgekorteNaamOpenbareRuimte>
                           <brp:gemeentedeel>Schilderswijk</brp:gemeentedeel>
                           <brp:huisnummer>${DataSource Values#huisnummer}</brp:huisnummer>
                           <brp:huisletter>${DataSource Values#huisletter}</brp:huisletter>
                           <brp:huisnummertoevoeging>${DataSource Values#huisnummerToevoeging}</brp:huisnummertoevoeging>
                           <brp:postcode>${DataSource Values#postcode}</brp:postcode>
                           <brp:woonplaatsnaam>Utrecht</brp:woonplaatsnaam>
                        </brp:adres>
                     </brp:adressen>
                  </brp:persoon>
               </brp:registratieAdres>
            </brp:acties>
         </brp:verhuizingIntergemeentelijk>
      </brp:bhg_vbaRegistreerVerhuizing>
   </soapenv:Body>
</soapenv:Envelope>
